{
  "transcript": "Hello guys, today I'm trying to explain to you how to do the client secrets for next year's application in a CI CD pipeline. I'm not sure you guys have tried this one before or not, but if you try it, this one is quite challenging. The reason that this one is challenging is because when you do the CI CD pipeline, in for example, you do the doctor image building and those kind of things in a normal way. What you do is that you put everything in your dot-end file and inside your project, for example, you have a dot-end file and after that you put it over there, you build your image and after you build your image, you tag it and after that you push it to the server or whatever. For example, you push it to your, for example, AWS or also. So that's when it's very stressful and simple and you just can follow the guideline. However, if you want to do this one on the GitHub size, for example, you want to put it in a CI CD pipeline bit, this one it becomes challenging. So why this one it becomes challenging because the environment that's, for example, you are building this guy, okay, supposed to have the secrets. Okay, it means that the place, okay, you need to have access to the client secrets in a place that their application is getting built. Okay, so for example, in this case scenario that, for example, you're doing the GitHub action, okay, so your doctor, your doctor, for example, you get environment that is building the doctor, so it's supposed to have that that environment that is building the application, okay, supposed to have access to, for example, your client secrets. Okay, so this one is a little bit challenging, okay, so let me explain that how I overcome the problem. So if you have a doctor for it, so inside the doctor for it, what I'm doing is that, this one is a simple one, okay, so I just pass, okay, so the secret, okay, I do not really secret it's a variable, okay, I just pass the variable, okay, through the, through the arguments, okay, and then, for example, I put that argument inside the environment of the doctor image that I'm building. I hope it makes sense, I don't know, I'm expelling it very well over up, but after that, I pass it to him, and after that, I do the MPM Ronbeath, okay, so when you do this, so then he's doing the MPM Ronbeath, he has access to this guy, okay, so why I'm doing this, because the reason that you're doing it, so now, for example, why you pass it through the argument, the reason that it is is that I cannot push my dot M file to the server side, right, so it means that, for example, if you see the normal procedure, it means that when they do the build, okay, they did it from the dot M file and those kind of things, right, but I cannot do that over there, right, so what's better is supposed to do is that the only thing that if I want to share, for example, secrets or variables or whatsoever inside the CI, CD, Python, exactly, exactly, exactly, so I have to put the secrets over there here, right, so when you put the secrets over here, you have to pass it somehow to your image creation and so on and so forth, right, so the way that I do that, okay, the solution like a common belief is that first the doctor file, we pass it through the argument value, and on the deploy side, it means that on the GitHub action side, okay, how I overcome the problem is through passing, okay, passing, okay, so even that all those secrets just now, you see over there, okay, so all the secrets over here, you see, okay, I am passing it through my, passing it through the, through the argument, okay, to be lit, okay, and this all these secrets, okay, for example, all the, for example, no, no, no, no, no, this one is down there, so, there is the next public area, so this one is this one, okay, so all those secrets is come from where it come from my the secrets that I set or environmental variables that I set inside my GitHub page, GitHub repository, okay, so all these secrets is set over there, okay, during the time that I'm calling the GitHub actions, okay, all these secrets is read and pass injected through the argument value to the doctor, and after that inside the doctor, okay, inside the doctor, the thing is get beat. I hope I explain well, although I think I'm a total failure, I tried my best to explain, okay, I think it's not very easy to explain the situation, okay, so if you go to the internet, the thing that I'm doing, everybody say that, okay, why you want to do this and it's kind of, it's flexibility, okay, so for example, if we're for example, some some some some stuff you want to be configuration, right, so you want to have a flexibility to pass the things around and so on and so forth, so yeah, so this is the end, please let me know if you have any questions, and I hope that the thing that I said it, it click for you, if not, please let me know, so I wrote a blog post also about this one, you can go check it down there, down, down below, you read it if you don't understand, I say you can ask me questions, down in the comments or something, thank you.",
  "segments": [
    {
      "start": 0.0,
      "end": 6.3,
      "text": "Hello guys, today I'm trying to explain to you how to do the client secrets for next year's"
    },
    {
      "start": 6.3,
      "end": 8.1,
      "text": "application in a CI CD pipeline."
    },
    {
      "start": 8.1,
      "end": 13.64,
      "text": "I'm not sure you guys have tried this one before or not, but if you try it, this one is quite"
    },
    {
      "start": 13.64,
      "end": 14.64,
      "text": "challenging."
    },
    {
      "start": 14.64,
      "end": 20.54,
      "text": "The reason that this one is challenging is because when you do the CI CD pipeline, in"
    },
    {
      "start": 20.54,
      "end": 26.34,
      "text": "for example, you do the doctor image building and those kind of things in a normal way."
    },
    {
      "start": 26.34,
      "end": 29.94,
      "text": "What you do is that you put everything in your dot-end file and inside your project,"
    },
    {
      "start": 29.94,
      "end": 34.18,
      "text": "for example, you have a dot-end file and after that you put it over there, you build your"
    },
    {
      "start": 34.18,
      "end": 38.02,
      "text": "image and after you build your image, you tag it and after that you push it to the server"
    },
    {
      "start": 38.02,
      "end": 39.02,
      "text": "or whatever."
    },
    {
      "start": 39.02,
      "end": 42.5,
      "text": "For example, you push it to your, for example, AWS or also."
    },
    {
      "start": 42.5,
      "end": 46.5,
      "text": "So that's when it's very stressful and simple and you just can follow the guideline."
    },
    {
      "start": 46.5,
      "end": 51.42,
      "text": "However, if you want to do this one on the GitHub size, for example, you want to put it"
    },
    {
      "start": 51.42,
      "end": 55.82,
      "text": "in a CI CD pipeline bit, this one it becomes challenging."
    },
    {
      "start": 55.82,
      "end": 59.78,
      "text": "So why this one it becomes challenging because the environment that's, for example, you"
    },
    {
      "start": 59.78,
      "end": 64.06,
      "text": "are building this guy, okay, supposed to have the secrets."
    },
    {
      "start": 64.06,
      "end": 69.86,
      "text": "Okay, it means that the place, okay, you need to have access to the client secrets in"
    },
    {
      "start": 69.86,
      "end": 73.54,
      "text": "a place that their application is getting built."
    },
    {
      "start": 73.54,
      "end": 78.78,
      "text": "Okay, so for example, in this case scenario that, for example, you're doing the GitHub action,"
    },
    {
      "start": 78.78,
      "end": 85.06,
      "text": "okay, so your doctor, your doctor, for example, you get environment that is building the"
    },
    {
      "start": 85.06,
      "end": 89.78,
      "text": "doctor, so it's supposed to have that that environment that is building the application,"
    },
    {
      "start": 89.78,
      "end": 94.58,
      "text": "okay, supposed to have access to, for example, your client secrets."
    },
    {
      "start": 94.58,
      "end": 100.9,
      "text": "Okay, so this one is a little bit challenging, okay, so let me explain that how I overcome"
    },
    {
      "start": 100.9,
      "end": 101.9,
      "text": "the problem."
    },
    {
      "start": 101.9,
      "end": 106.82,
      "text": "So if you have a doctor for it, so inside the doctor for it, what I'm doing is that,"
    },
    {
      "start": 106.82,
      "end": 112.86,
      "text": "this one is a simple one, okay, so I just pass, okay, so the secret, okay, I do not"
    },
    {
      "start": 112.86,
      "end": 119.54,
      "text": "really secret it's a variable, okay, I just pass the variable, okay, through the, through"
    },
    {
      "start": 119.54,
      "end": 125.38,
      "text": "the arguments, okay, and then, for example, I put that argument inside the environment"
    },
    {
      "start": 125.38,
      "end": 129.02,
      "text": "of the doctor image that I'm building."
    },
    {
      "start": 129.02,
      "end": 133.98,
      "text": "I hope it makes sense, I don't know, I'm expelling it very well over up, but after that,"
    },
    {
      "start": 133.98,
      "end": 140.42,
      "text": "I pass it to him, and after that, I do the MPM Ronbeath, okay, so when you do this,"
    },
    {
      "start": 140.42,
      "end": 147.9,
      "text": "so then he's doing the MPM Ronbeath, he has access to this guy, okay, so why I'm doing"
    },
    {
      "start": 147.9,
      "end": 151.98,
      "text": "this, because the reason that you're doing it, so now, for example, why you pass it through"
    },
    {
      "start": 151.98,
      "end": 158.18,
      "text": "the argument, the reason that it is is that I cannot push my dot M file to the server side,"
    },
    {
      "start": 158.18,
      "end": 161.78,
      "text": "right, so it means that, for example, if you see the normal procedure, it means that"
    },
    {
      "start": 161.78,
      "end": 165.38,
      "text": "when they do the build, okay, they did it from the dot M file and those kind of things,"
    },
    {
      "start": 165.38,
      "end": 170.06,
      "text": "right, but I cannot do that over there, right, so what's better is supposed to do is that"
    },
    {
      "start": 170.06,
      "end": 173.98,
      "text": "the only thing that if I want to share, for example, secrets or variables or whatsoever"
    },
    {
      "start": 173.98,
      "end": 179.9,
      "text": "inside the CI, CD, Python, exactly, exactly, exactly, so I have to put the secrets over"
    },
    {
      "start": 179.9,
      "end": 188.14,
      "text": "there here, right, so when you put the secrets over here, you have to pass it somehow to your"
    },
    {
      "start": 188.14,
      "end": 194.54,
      "text": "image creation and so on and so forth, right, so the way that I do that, okay, the solution"
    },
    {
      "start": 194.54,
      "end": 198.7,
      "text": "like a common belief is that first the doctor file, we pass it through the argument value,"
    },
    {
      "start": 199.34,
      "end": 205.18,
      "text": "and on the deploy side, it means that on the GitHub action side, okay, how I overcome the"
    },
    {
      "start": 205.18,
      "end": 212.62,
      "text": "problem is through passing, okay, passing, okay, so even that all those secrets just now,"
    },
    {
      "start": 212.62,
      "end": 219.66,
      "text": "you see over there, okay, so all the secrets over here, you see, okay, I am passing it through my,"
    },
    {
      "start": 219.9,
      "end": 229.34,
      "text": "passing it through the, through the argument, okay, to be lit, okay, and this all these secrets,"
    },
    {
      "start": 229.34,
      "end": 232.78,
      "text": "okay, for example, all the, for example, no, no, no, no, no, this one is down there, so,"
    },
    {
      "start": 233.98,
      "end": 239.1,
      "text": "there is the next public area, so this one is this one, okay, so all those secrets is come from"
    },
    {
      "start": 239.1,
      "end": 245.82,
      "text": "where it come from my the secrets that I set or environmental variables that I set inside my"
    },
    {
      "start": 245.9,
      "end": 252.62,
      "text": "GitHub page, GitHub repository, okay, so all these secrets is set over there, okay, during the time"
    },
    {
      "start": 252.62,
      "end": 257.82,
      "text": "that I'm calling the GitHub actions, okay, all these secrets is read and pass injected through"
    },
    {
      "start": 257.82,
      "end": 263.66,
      "text": "the argument value to the doctor, and after that inside the doctor, okay, inside the doctor,"
    },
    {
      "start": 263.66,
      "end": 271.18,
      "text": "the thing is get beat. I hope I explain well, although I think I'm a total failure,"
    },
    {
      "start": 271.98,
      "end": 277.42,
      "text": "I tried my best to explain, okay, I think it's not very easy to explain the situation, okay,"
    },
    {
      "start": 277.42,
      "end": 281.42,
      "text": "so if you go to the internet, the thing that I'm doing, everybody say that, okay,"
    },
    {
      "start": 281.42,
      "end": 285.98,
      "text": "why you want to do this and it's kind of, it's flexibility, okay, so for example, if we're"
    },
    {
      "start": 285.98,
      "end": 290.86,
      "text": "for example, some some some some stuff you want to be configuration, right, so you want to have"
    },
    {
      "start": 290.86,
      "end": 298.06,
      "text": "a flexibility to pass the things around and so on and so forth, so yeah, so this is the end,"
    },
    {
      "start": 298.94,
      "end": 307.26,
      "text": "please let me know if you have any questions, and I hope that the thing that I said it,"
    },
    {
      "start": 308.3,
      "end": 313.98,
      "text": "it click for you, if not, please let me know, so I wrote a blog post also about this one,"
    },
    {
      "start": 313.98,
      "end": 319.34,
      "text": "you can go check it down there, down, down below, you read it if you don't understand, I say you can"
    },
    {
      "start": 319.34,
      "end": 322.46,
      "text": "ask me questions, down in the comments or something, thank you."
    }
  ]
}
